const QUESTION_ARRAY = [
  {
    'content': '在面临一个紧急的项目交付期限时，你即使超时完成也会注重完成质量',
  },
  {
    'content': '你不会因为程序被其他人发现bug而感到羞耻和尴尬，相反你觉得这是正常的事情',
  },
  {
    'content': '你完成了一个新功能的开发，但在代码审查中发现有一些潜在的优化和改进的地方，你愿意花更多时间进行全面的代码优化，以确保高质量。',
  },
  {
    'content': '项目引入一项新技术，但这可能导致学习曲线和一些额外的开发时间。你希望希望尽快引入新技术，即使牺牲一些质量。',
  },
  {
    'content': '你喜欢算法并经常参加算法竞赛',
  },
  {
    'content': '你经常愿意牺牲可读性来优化性能',
  },
  {
    'content': '你会保证项目的功能稳定性，出于风险角度，有些地方暂不考虑优化',
  },
  {
    'content': '你认为注释写详细是浪费时间，良好的代码是“自文档”的',
  },
  {
    'content': '多数时候，相比新框架，你更愿意使用自己熟练掌握的方式和技术来做项目',
  },
  {
    'content': '你花了很多时间学习了很多不同的语言和框架，并且有人认为你会的很多',
  },
  {
    'content': '你认为写出不同的前端界面、样式和UI交互很有趣（如果你还没学过和尝试过，请选择中立）',
  },
  {
    'content': '当你写的程序能可视化，甚至能用鼠标等设备进行交互时，你会很高兴。',
  },
  {
    'content': '',
  },
  {
    'content': '设计并做出一个庞大复杂的系统对你来说并不困难。',
  },
]